{
  "eventDeck": [
    {
      "id": "whisper-in-the-crack",
      "title": "Шёпот из Трещины",
      "flavor": "Тонкая линия в полу шепчет голоса тех, кого давно не слышали. Они знают, где ключ от последней двери.",
      "effect": "Эффект: каждый следователь должен потратить 1 рассудок или поместить жетон разрушения на ближайшую локацию.",
      "type": "mystery",
      "choices": [
        {
          "id": "choice-a",
          "label": "Вариант A — Склониться над трещиной",
          "result": "Вы вслушались в шёпот и рискнули рассудком ради подсказки.",
          "effects": {
            "logType": "[Событие]",
            "logVariant": "story",
            "statDeltas": [
              {
                "statId": "sanity",
                "delta": -1
              }
            ],
            "cluesGained": 2
          }
        },
        {
          "id": "choice-b",
          "label": "Вариант B — Запечатать мелом",
          "result": "Мел вспыхнул белым огнём, и давление трещины ослабло.",
          "effects": {
            "logType": "[Событие]",
            "logVariant": "story",
            "doomDelta": -1,
            "actionsDelta": -2
          }
        }
      ]
    },
    {
      "id": "cold-mist",
      "title": "Холодный Туман",
      "flavor": "Туман сгущается вокруг маяка и вытягивает тепло из костей.",
      "effect": "Каждый следователь получает 1 урона, а трек ужаса растёт.",
      "type": "defeat",
      "immediateEffects": {
        "logType": "[Эффект]",
        "logVariant": "effect",
        "statDeltas": [
          { "statId": "health", "delta": -1 }
        ],
        "doomDelta": 1
      }
    },
    {
      "id": "ghostly-signal",
      "title": "Призрачный Сигнал",
      "flavor": "Неясный свет вспыхивает на горизонте — будто сам Арден зовёт на помощь.",
      "effect": "Кто-то или что-то помогает вам: получите улику и восстановите рассудок.",
      "type": "mystery",
      "immediateEffects": {
        "logType": "[Поддержка]",
        "logVariant": "effect",
        "victoryDelta": 1,
        "statDeltas": [
          { "statId": "sanity", "delta": 1 }
        ]
      }
    },
    {
      "id": "pier_steps",
      "title": "Шаги за пристанью",
      "type": "mystery",
      "flavor": "Туман стелется низко, и в этой белой тишине слышны мягкие шаги. Они чужие и слишком медленные, чтобы принадлежать человеку.",
      "effect": "Можно бросить жребий: приблизиться и попытаться найти источник или затаиться и переждать.",
      "choices": [
        {
          "id": "pier_steps_investigate",
          "label": "Подойти ближе",
          "chance": 0.6,
          "successText": "Ты обходишь настил и находишь фонарь Ардена — холодный, но ещё недавно горящий. Рядом глубокие следы, будто что-то тяжёлое уползало к воде.",
          "failText": "Ты делаешь шаг вперёд, и туман сомкнулся вокруг тебя, будто втягивая воздух. Шаги обрываются — но только потому, что теперь они слышны у тебя за спиной.",
          "successEffects": {
            "cluesGained": 1,
            "statDeltas": [
              { "statId": "sanity", "delta": -1 }
            ]
          },
          "failEffects": {
            "statDeltas": [
              { "statId": "sanity", "delta": -2 }
            ],
            "noise": 1
          }
        },
        {
          "id": "pier_steps_stay_back",
          "label": "Остаться на месте",
          "chance": 1,
          "successText": "Ты замираешь, позволяя звуку шагов раствориться. Но стоя в одиночестве в сгущающемся тумане, ощущаешь, как холод проникает слишком глубоко.",
          "successEffects": {
            "statDeltas": [
              { "statId": "sanity", "delta": -1 },
              { "statId": "health", "delta": -1 }
            ]
          }
        }
      ]
    },
    {
      "id": "water_silhouette",
      "title": "Силуэт у воды",
      "type": "mystery",
      "flavor": "На границе тумана стоит тёмная фигура. Она не двигается, но туман у её ног колышется, будто что-то под водой дышит.",
      "effect": "Силуэт у самой воды манит ответами: решите, приблизиться ли за подсказкой или отступить и переждать холодный взгляд.",
      "options": [
        {
          "id": "approach",
          "label": "Приблизиться",
          "chance": 0.25,
          "success_text": "Ты подходишь ближе и понимаешь: перед тобой лежит потрёпанная записная книжка Ардена. Она пропитана водой и дрожит в руках, словно всё ещё слышит шёпоты. Но стоит тебе взять её — силуэт исчезает, растворившись в воде, и холод накрывает кости.",
          "fail_text": "Ты делаешь пару шагов вперёд, и вода у самой кромки вспучивается, будто что-то поднялось снизу. Туман обхватывает ноги ледяным обручем, и фигура наклоняет голову — прямо на тебя.",
          "effect": {
            "onSuccess": {
              "clue": 1,
              "sanity": 2
            },
            "onFail": {
              "sanity": 2,
              "wound": 1
            }
          }
        },
        {
          "id": "step_back",
          "label": "Отступить",
          "chance": 1,
          "success_text": "Ты делаешь шаг назад. Фигура сливается с туманом, будто наблюдала за тобой, а затем потеряла интерес. Но дыхание становится тяжёлым, и тревога давит в груди, будто ты избежал не опасности, а ответа.",
          "fail_text": "",
          "effect": {
            "onSuccess": {
              "sanity": 1,
              "omen": 1
            }
          }
        }
      ]
    },
    {
      "id": "pier_knock",
      "title": "Глухой стук под настилом",
      "type": "mystery",
      "flavor": "Доски под тобой глухо вибрируют, будто кто-то снизу стучит кулаком о дерево — медленно, размеренно, почти настойчиво.",
      "effect": "Определись, ответить ли на зов тумана или отступить, пока не прорвало лёд под ногами.",
      "options": [
        {
          "id": "knock_back",
          "label": "Постучать в ответ",
          "chance": 0.2,
          "success_text": "Ты отвечаешь ударом, и в ответ слышишь слабый, неровный стук — словно кто-то пытается передать тебе ритм. Под доской находишь металлическую пуговицу с маячной формы Ардена, но вибрация усиливается, прокатываясь по ногам, как чужое сердцебиение.",
          "fail_text": "Ты стучишь, и в ответ раздаётся чеканный, тяжёлый удар — слишком мощный, чтобы быть человеческим. Доски дрожат так сильно, что по коже бегут мурашки, а холод пробирает до костей.",
          "effect": {
            "onSuccess": {
              "clue": 1,
              "sanity": 2
            },
            "onFail": {
              "sanity": 2,
              "cold": 1
            }
          }
        },
        {
          "id": "step_aside",
          "label": "Отойти в сторону",
          "chance": 1,
          "success_text": "Ты отходишь от настила, и стук сразу прекращается, словно источник звука следил именно за твоими шагами. Но внезапный порыв влажного ветра бьёт в лицо, и ты чувствуешь на коже неприятный трепет — будто тебя только что позвали по имени.",
          "fail_text": "",
          "effect": {
            "onSuccess": {
              "sanity": 1,
              "omen": 1
            }
          }
        }
      ]
    }
  ]
}
