{
  "playerDeck": {
    "hand": [],
    "drawPile": [
      {
        "id": "look_around",
        "name": "Оглядеться по сторонам",
        "title": "Оглядеться по сторонам",
        "description": "Исследуйте окрестности маяка. При успехе получайте 1 улику.",
        "costs": ["1 действие"],
        "actionCost": 1,
        "tooltip": "Стоит присесть и прислушаться к мокрым доскам.",
        "playable": true,
        "type": "Исследование",
        "effect": 1,
        "chance": 0.3,
        "successCount": 1,
        "failCount": 0,
        "flavor": "Воды спокойны… но слишком спокойны.",
        "successText": "Ты замечаешь на влажных досках тонкий белый след — мел, которым Арден отмечал опасные места. След ведёт к старому волнорезу, где, как говорят, он видел первые тени в тумане.",
        "failText": "Туман шевелится у самой воды, и какое-то мгновение кажется, что он обходит тебя стороной. Ты стараешься всмотреться, но всё расплывается, будто кто-то закрыл тебе глаза ладонью."
      },
      {
        "id": "chalk_mark",
        "name": "Найти мелкую отметку",
        "title": "Найти мелкую отметку",
        "description": "Высматривайте на камне свежие отметки Ардена, чтобы выследить его путь и получить улику.",
        "costs": ["1 действие"],
        "actionCost": 1,
        "tooltip": "Следы мела появляются там, где Арден чувствовал опасность.",
        "playable": true,
        "type": "Исследование",
        "effect": 1,
        "chance": 0.35,
        "successCount": 1,
        "failCount": 0,
        "flavor": "Арден всегда оставлял метки для себя… если был напуган.",
        "successText": "На каменном устое ты находишь свежую мелкую риску. Под ней — короткая надпись, едва различимая: «НЕ СМОТРЕТЬ В ТУМАН». Буквы неровные, как будто Арден писал их, дрожа от холода или страха.",
        "failText": "Ты осматриваешь стены, но туман прилипает к камню слишком плотно. Линии и трещины сливаются в одно, и кажется, будто кто-то только что стёр след, который ты почти заметил."
      },
      {
        "id": "abandoned_boat_clue",
        "name": "Осмотреть одинокую лодку",
        "title": "Осмотреть одинокую лодку",
        "description": "Проверяйте лодку у причала — возможно, там остались следы побега смотрителя и ещё одна улика.",
        "costs": ["1 действие"],
        "actionCost": 1,
        "tooltip": "В темноте лодка кажется пустой, но ты чувствуешь чьё-то присутствие.",
        "playable": true,
        "type": "Исследование",
        "effect": 1,
        "chance": 0.4,
        "successCount": 1,
        "failCount": 0,
        "flavor": "В темноте лодка кажется пустой… но не заброшенной.",
        "successText": "Под скамьёй ты находишь клочок промокшего плаща — ткань маячного смотрителя. На краю — след сухой соли, будто Арден спешно выскакивал из лодки, спасаясь от чего-то, что приближалось по воде.",
        "failText": "Доски лодки стонут под пальцами так, будто лодка сама вздыхает. Ничего полезного — только ощущение, что кто-то недавно сидел здесь, наблюдая за берегом."
      }
    ],
    "discardPile": []
  }
}
